# 1. Написать lambda функцию, определяющую четное/нечетное. Функция принимает параметр (число) и если четное, то выдает
# слово "четное", если нет - то "нечетное"

# 2. Дан список чисел. Вернуть список, где при помощи map() каждое число переведено в строку. В map() в качестве
# функции передавать lambda

# 3. При помощи функции filter() из кортежа слов отфильтровать только те, которые являются полиндромами

# 4. Написать декоратор к 2-м любым функциям, который считает время выполнения функций

# *5. Сделать функцию, которая на вход принимает строку. Анализирует ее методом .isdigit() и переводит строку в число.
# Функция должна распознавать отрицательные и дробные числа